/********************************************************************************************
 * arch/arm/src/samd5e5/chip/sam_usb.h
 *
 *   Copyright (C) 2018 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS

#  define USBHOST_PKTSIZE_SIZE_64B     (3 << USBHOST_PKTSIZE_SIZE_SHIFT) /* 64 bytes */
#  define USBHOST_PKTSIZE_SIZE_128B    (4 << USBHOST_PKTSIZE_SIZE_SHIFT) /* 128 bytes (isoc only) */
#  define USBHOST_PKTSIZE_SIZE_256B    (5 << USBHOST_PKTSIZE_SIZE_SHIFT) /* 256 bytes (isoc only) */
#  define USBHOST_PKTSIZE_SIZE_512B    (6 << USBHOST_PKTSIZE_SIZE_SHIFT) /* 512 bytes (isoc only) */
#  define USBHOST_PKTSIZE_SIZE_1023B   (7 << USBHOST_PKTSIZE_SIZE_SHIFT) /* 1023 bytes (isoc only) */
#define USBHOST_PKTSIZE_AUTOZLP        (1 << 31) /* Bit 31: Automatic zero length packet */

/* Extended register (Bank 0 only) */

#define USBHOST_EXTREG_SUBPID_SHIFT    (0)       /* Bits 0-3:  SUBPID */
#define USBHOST_EXTREG_SUBPID_MASK     (15 << USBHOST_EXTREG_SUBPID_SHIFT)
#  define USBHOST_EXTREG_SUBPID(n)     ((uint16_t)(n) << USBHOST_EXTREG_SUBPID_SHIFT)
#define USBHOST_EXTREG_VARIABLE_SHIFT  (4)       /* Bits 4-14:  VARIABLE */
#define USBHOST_EXTREG_VARIABLE_MASK   (0x7ff << USBHOST_EXTREG_VARIABLE_SHIFT)
#  define USBHOST_EXTREG_VARIABLE(n)   ((uint16_t)(n) << USBHOST_EXTREG_VARIABLE_SHIFT)

/* host status bank (Both banks) */

#define USBHOST_STATUSBK_CRCERR        (1 << 0)  /* Bit 0:  CRC error */
#define USBHOST_STATUSBK_ERRORFLOW     (1 << 1)  /* Bit 1:  Error flow status */

/* Host control pipe (Bank 0 only) */

#define USBHOST_CTRLPIPE_PDADDR_SHIFT  (0)       /* Bits 0-6:  Pipe device address */
#define USBHOST_CTRLPIPE_PDADDR_MASK   (0x7f << USBHOST_CTRLPIPE_PDADDR_SHIFT)
#  define USBHOST_CTRLPIPE_PDADDR(n)   ((uint16_t)(n) << USBHOST_CTRLPIPE_PDADDR_SHIFT)
#define USBHOST_CTRLPIPE_PEPNUM_SHIFT  (8)       /* Bits 8-11:  Pipe endpoint number */
#define USBHOST_CTRLPIPE_PEPNUM_MASK   (15 << USBHOST_CTRLPIPE_PEPNUM_SHIFTxx)
#  define USBHOST_CTRLPIPE_PEPNUM(n)   ((uint16_t)(n) << USBHOST_CTRLPIPE_PEPNUM_SHIFTxx)
#define USBHOST_CTRLPIPE_PEPMAX_SHIFT  (12)      /* Bitx 12-15:  Pipe error max number */
#define USBHOST_CTRLPIPE_PEPMAX_MASK   (15 << USBHOST_CTRLPIPE_PEPMAX_SHIFT)
#  define USBHOST_CTRLPIPE_PEPMAX(n)   ((uint16_t)(n) << USBHOST_CTRLPIPE_PEPMAX_SHIFT)

/* Host status pipe (Both banks) */

#define USBHOST_STATUSPIPE_DTGLER      (1 << 0)  /* Bit 0:  Data toggle error */
#define USBHOST_STATUSPIPE_DAPIDER     (1 << 1)  /* Bit 1:  Data PID error */
#define USBHOST_STATUSPIPE_PIDER       (1 << 2)  /* Bit 2:  PID error */
#define USBHOST_STATUSPIPE_TOUTER      (1 << 3)  /* Bit 3:  Timeout error */
#define USBHOST_STATUSPIPE_CRC16ER     (1 << 4)  /* Bit 4:  CRC16 error */
#define USBHOST_STATUSPIPE_ERCNT_SHIFT (5)       /* Bits 5-7:  Pipe error counter */
#define USBHOST_STATUSPIPE_ERCNT_MASK  (7 << USBHOST_STATUSPIPE_ERCNT_SHIFT)
#  define USBHOST_STATUSPIPE_ERCNT(n)  ((uint16_t)(n) << USBHOST_STATUSPIPE_ERCNT_SHIFT)

/********************************************************************************************
 * Public Types
 ********************************************************************************************/

/* Device Endpoint Descriptor.  See USBDEV_* bit definitions above. */

struct usbdev_epdesc_s
{
  uint32_t addr;        /* 0x0000-0x0003: Address of Data buffer (Both banks) */
  uint32_t pktsize;     /* 0x0004-0x0007: Packet Size (Both banks) */
  uint16_t extreg;      /* 0x0008-0x0009: Extended Register (Bank 0 only) */
  uint8_t  stausbk;     /* 0x000a-0x000a: Device Status Bank (Both banks) */
  uint8_t  reserved[5]; /* 0x000b-0x000f: Both banks */
};

/* Host Pipe Descriptor.  See USBHOST_* bit definitions above */

struct usbhost_pipedesc_s
{
  uint32_t addr;        /* 0x0000-0x0003: Address of Data buffer (Both banks) */
  uint32_t pktsize;     /* 0x0004-0x0007: Packet Size (Both banks) */
  uint16_t extreg;      /* 0x0008-0x0009: Extended Register (Bank 0 only) */
  uint8_t  stausbk;     /* 0x000a-0x000a: Device Status Bank (Both banks) */
  uint8_t  reserved;    /* 0x000b-0x000b: Both banks */
  uint16_t ctrlpipe;    /* 0x000c-0x000d: Host control pipe (Bank 0 only) */
  uint16_t statuspipe;  /* 0x000e-0x000f: Host status pipe (Both banks) */
};

/********************************************************************************************
 * Public Data
 ********************************************************************************************/

/********************************************************************************************
 * Public Functions
 ********************************************************************************************/

#endif /* __ARCH_ARM_SRC_SAMD5E5_CHIP_SAM_USB_H */
