/*
 * Copyright (c) 2021-2023 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_MCAN_H
#define HPM_MCAN_H

typedef struct {
    __R  uint8_t  RESERVED0[4];                /* 0x0 - 0x3: Reserved */
    __R  uint32_t ENDN;                        /* 0x4: endian register */
    __R  uint8_t  RESERVED1[4];                /* 0x8 - 0xB: Reserved */
    __RW uint32_t DBTP;                        /* 0xC: data bit timing and prescaler, writeable when CCCR.CCE and CCCR.INT are set */
    __RW uint32_t TEST;                        /* 0x10: test register */
    __RW uint32_t RWD;                         /* 0x14: ram watchdog */
    __RW uint32_t CCCR;                        /* 0x18: CC control register */
    __RW uint32_t NBTP;                        /* 0x1C: nominal bit timing and prescaler register */
    __RW uint32_t TSCC;                        /* 0x20: timestamp counter configuration */
    __R  uint32_t TSCV;                        /* 0x24: timestamp counter value */
    __RW uint32_t TOCC;                        /* 0x28: timeout counter configuration */
    __R  uint32_t TOCV;                        /* 0x2C: timeout counter value */
    __R  uint8_t  RESERVED2[16];               /* 0x30 - 0x3F: Reserved */
    __R  uint32_t ECR;                         /* 0x40: error counter register */
    __R  uint32_t PSR;                         /* 0x44: protocol status register */
    __RW uint32_t TDCR;                        /* 0x48: transmitter delay compensation */
    __R  uint8_t  RESERVED3[4];                /* 0x4C - 0x4F: Reserved */
    __RW uint32_t IR;                          /* 0x50: interrupt register */
    __RW uint32_t IE;                          /* 0x54: interrupt enable */
    __RW uint32_t ILS;                         /* 0x58: interrupt line select */
    __RW uint32_t ILE;                         /* 0x5C: interrupt line enable */
    __R  uint8_t  RESERVED4[32];               /* 0x60 - 0x7F: Reserved */
    __RW uint32_t GFC;                         /* 0x80: global filter configuration */
    __RW uint32_t SIDFC;                       /* 0x84: standard ID filter configuration */
    __RW uint32_t XIDFC;                       /* 0x88: extended ID filter configuration */
    __R  uint8_t  RESERVED5[4];                /* 0x8C - 0x8F: Reserved */
    __RW uint32_t XIDAM;                       /* 0x90: extended id and mask */
    __R  uint32_t HPMS;                        /* 0x94: high priority message status */
    __RW uint32_t NDAT1;                       /* 0x98: new data1 */
    __RW uint32_t NDAT2;                       /* 0x9C: new data2 */
    __RW uint32_t RXF0C;                       /* 0xA0: rx fifo 0 configuration */
    __R  uint32_t RXF0S;                       /* 0xA4: rx fifo 0 status */
    __RW uint32_t RXF0A;                       /* 0xA8: rx fifo0 acknowledge */
    __RW uint32_t RXBC;                        /* 0xAC: rx buffer configuration */
    __RW uint32_t RXF1C;                       /* 0xB0: rx fifo1 configuration */
    __R  uint32_t RXF1S;                       /* 0xB4: rx fifo1 status */
    __RW uint32_t RXF1A;                       /* 0xB8: rx fifo 1 acknowledge */
    __RW uint32_t RXESC;                       /* 0xBC: rx buffer/fifo element size configuration */
    __RW uint32_t TXBC;                        /* 0xC0: tx buffer configuration */
    __R  uint32_t TXFQS;                       /* 0xC4: tx fifo/queue status */
    __RW uint32_t TXESC;                       /* 0xC8: tx buffer element size configuration */
    __R  uint32_t TXBRP;                       /* 0xCC: tx buffer request pending */
    __RW uint32_t TXBAR;                       /* 0xD0: tx buffer add request */
    __RW uint32_t TXBCR;                       /* 0xD4: tx buffer cancellation request */
    __R  uint32_t TXBTO;                       /* 0xD8: tx buffer transmission occurred */
    __R  uint32_t TXBCF;                       /* 0xDC: tx buffer cancellation finished */
    __RW uint32_t TXBTIE;                      /* 0xE0: tx buffer transmission interrupt enable */
    __RW uint32_t TXBCIE;                      /* 0xE4: tx buffer cancellation finished interrupt enable */
    __R  uint8_t  RESERVED6[8];                /* 0xE8 - 0xEF: Reserved */
    __RW uint32_t TXEFC;                       /* 0xF0: tx event fifo configuration */
    __R  uint32_t TXEFS;                       /* 0xF4: tx event fifo status */
    __RW uint32_t TXEFA;                       /* 0xF8: tx event fifo acknowledge */
    __R  uint8_t  RESERVED7[260];              /* 0xFC - 0x1FF: Reserved */
    __R  uint32_t TS_SEL[16];                  /* 0x200 - 0x23C: timestamp 0 */
    __R  uint32_t CREL;                        /* 0x240: core release register */
    __RW uint32_t TSCFG;                       /* 0x244: timestamp configuration */
    __R  uint32_t TSS1;                        /* 0x248: timestamp status1 */
    __R  uint32_t TSS2;                        /* 0x24C: timestamp status2 */
    __R  uint32_t ATB;                         /* 0x250: actual timebase */
    __R  uint32_t ATBH;                        /* 0x254: actual timebase high */
    __R  uint8_t  RESERVED8[424];              /* 0x258 - 0x3FF: Reserved */
    __RW uint32_t GLB_CTL;                     /* 0x400: global control */
    __R  uint32_t GLB_STATUS;                  /* 0x404: global status */
    __R  uint32_t GLB_CAN_IR;                  /* 0x408: global m_can_ir */
    __R  uint8_t  RESERVED9[7156];             /* 0x40C - 0x1FFF: Reserved */
    __RW uint32_t MESSAGE_BUFF[640];           /* 0x2000 - 0x29FC: message buff */
} MCAN_Type;


/* Bitfield definition for register: ENDN */
/*
 * EVT (R)
 *
 * evt
 */
#define MCAN_ENDN_EVT_MASK (0xFFFFFFFFUL)
#define MCAN_ENDN_EVT_SHIFT (0U)
#define MCAN_ENDN_EVT_GET(x) (((uint32_t)(x) & MCAN_ENDN_EVT_MASK) >> MCAN_ENDN_EVT_SHIFT)

/* Bitfield definition for register: DBTP */
/*
 * TDC (RW)
 *
 * transmitter delay compensation enable
 */
#define MCAN_DBTP_TDC_MASK (0x800000UL)
#define MCAN_DBTP_TDC_SHIFT (23U)
#define MCAN_DBTP_TDC_SET(x) (((uint32_t)(x) << MCAN_DBTP_TDC_SHIFT) & MCAN_DBTP_TDC_MASK)
#define MCAN_DBTP_TDC_GET(x) (((uint32_t)(x) & MCAN_DBTP_TDC_MASK) >> MCAN_DBTP_TDC_SHIFT)

/*
 * DBRP (RW)
 *
 * data bit rate prescaler, value range is 0-31 when TDC = 0, 0-1 when TDC=1
 */
#define MCAN_DBTP_DBRP_MASK (0x1F0000UL)
#define MCAN_DBTP_DBRP_SHIFT (16U)
#define MCAN_DBTP_DBRP_SET(x) (((uint32_t)(x) << MCAN_DBTP_DBRP_SHIFT) & MCAN_DBTP_DBRP_MASK)
