/*
 * Copyright (c) 2021-2022 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_XPI_H
#define HPM_XPI_H

typedef struct {
    __RW uint32_t GCR0;                        /* 0x0: XPI General Configuration Register 0 */
    __R  uint8_t  RESERVED0[4];                /* 0x4 - 0x7: Reserved */
    __RW uint32_t GCR1;                        /* 0x8: XPI General Configuration Register 1 */
    __RW uint32_t MACR;                        /* 0xC: Memory-mapped Access Configuration Register */
    __RW uint32_t INTEN;                       /* 0x10: Interrupt Enable register. */
    __RW uint32_t INTR;                        /* 0x14: Interrupt register. */
    __RW uint32_t INSTRKEY;                    /* 0x18: INSGPR password register */
    __RW uint32_t INSTRLCK;                    /* 0x1C: INSGPR access lock control */
    __RW uint32_t AHBBUFCR[8];                 /* 0x20 - 0x3C: AHB Rx Buffer control register 0 */
    __R  uint8_t  RESERVED1[32];               /* 0x40 - 0x5F: Reserved */
    __RW uint32_t DEVSIZE[4];                  /* 0x60 - 0x6C: Size for A1 device */
    __RW uint32_t DEVATTR[4];                  /* 0x70 - 0x7C: Attribute for A1 device */
    __RW uint32_t DEVMACR[4];                  /* 0x80 - 0x8C: Memory-mapped Access Confiugration for A1 device */
    __R  uint8_t  RESERVED2[4];                /* 0x90 - 0x93: Reserved */
    __RW uint32_t DEVMISC;                     /* 0x94: Misc. for Device */
    __R  uint8_t  RESERVED3[8];                /* 0x98 - 0x9F: Reserved */
    __RW uint32_t APBDAR;                      /* 0xA0: APB Device Address Register */
    __RW uint32_t APBINSCR;                    /* 0xA4: APB Sequence Configuration Register */
    __R  uint8_t  RESERVED4[8];                /* 0xA8 - 0xAF: Reserved */
    __RW uint32_t APBCMD;                      /* 0xB0: APB Command Reg. */
    __R  uint8_t  RESERVED5[4];                /* 0xB4 - 0xB7: Reserved */
    __RW uint32_t PRXFCR;                      /* 0xB8: APB RX FIFO Control Register */
    __RW uint32_t PTXFCR;                      /* 0xBC: APB TX FIFO Control Register */
    __RW uint32_t DLLCR[2];                    /* 0xC0 - 0xC4: DLL Control  Register for CA */
    __R  uint8_t  RESERVED6[24];               /* 0xC8 - 0xDF: Reserved */
    __RW uint32_t STAT0;                       /* 0xE0: Status Register 0 */
    __RW uint32_t STAT1;                       /* 0xE4: Status Register 1 */
    __RW uint32_t STAT2;                       /* 0xE8: Status Register 2 */
    __RW uint32_t AHBSPNDSTS;                  /* 0xEC: AHB RX FIFO STATUS */
    __RW uint32_t PRXFSTS;                     /* 0xF0: APB RX FIFO STATUS */
    __RW uint32_t PTXFSTS;                     /* 0xF4: APB TX FIFO STATUS */
    __R  uint8_t  RESERVED7[8];                /* 0xF8 - 0xFF: Reserved */
    __R  uint32_t PRX[32];                     /* 0x100 - 0x17C: APB RX FIFO Data Register. */
    __W  uint32_t PTX[32];                     /* 0x180 - 0x1FC: APB TX FIFO Data Register. */
    __RW uint32_t INSTR[16];                   /* 0x200 - 0x23C: Istruction Group 0 */
} XPI_Type;


/* Bitfield definition for register: GCR0 */
/*
 * OCTCACB (RW)
 *
 * This  bit is to support Flash Octal mode access by combining Port A and B Data pins  (A_DATA[3:0] and  B_DATA[3:0]).
 * NOTE: Combination mode is not supported if Port A and Port B are 8 bit data  width. This bit should be set to zero in this case.
 * 0 - Disable.
 * 1 - Enable
 */
#define XPI_GCR0_OCTCACB_MASK (0x2000U)
#define XPI_GCR0_OCTCACB_SHIFT (13U)
#define XPI_GCR0_OCTCACB_SET(x) (((uint32_t)(x) << XPI_GCR0_OCTCACB_SHIFT) & XPI_GCR0_OCTCACB_MASK)
#define XPI_GCR0_OCTCACB_GET(x) (((uint32_t)(x) & XPI_GCR0_OCTCACB_MASK) >> XPI_GCR0_OCTCACB_SHIFT)

/*
 * HALFSPD (RW)
 *
 * Half  Speed Serial Flash access Enable.
